{
  "personalInfo": {
    "name": "Evan Jacobs"
  },
  "summary": "Seasoned TypeScript engineer with curiosity toward other languages. I build highly-productive codebases, including: design systems, internal libraries, documentation, etc. My specialty is frontend, but I am happy to work throughout the stack. Supplemental skills include: UX design, marketing, and product management.",
  "workExperience": [
    {
      "company": "Aurora Solar",
      "url": "https://aurorasolar.com/",
      "icon": "https://aurorasolar.com/wp-content/themes/aurora-solar/assets/img/favicon.svg",
      "title": "Principal Software Engineer",
      "period": "8/2021 - Present",
      "description": "Architected and executed a design system and high-automation localization platform for 12+ engineering pods. Now on the Developer Productivity pod improving the authoring experience and cycle time for our core monorepo.",
      "responsibilities": [
        "Education and mentorship of other engineers through pairing, educational videos, office hours, etc",
        "Built all components, patterns, and technical writings listed on ds.auslr.io",
        "Shaped UX processes on the design team and regularly engage in designer-requested review and feasibility sessions of upcoming work across the organization",
        "Concepted and executed the tooling for the company's engineering localization strategy leveraging the CrowdIn TMS, DeepL translation engine, and a lightweight internal library leveraging web platform primitives like Intl",
        "Maintenance assistance for relevant open source libraries, like: formik, styled-components, xstyled",
        "Implemented ARM architecture across our fleet of Docker containers and saved the company >$200k annually on compute for a very expensive e2e test suite"
      ]
    },
    {
      "company": "ButcherBox",
      "title": "Software Architect",
      "url": "https://www.butcherbox.com/",
      "icon": "https://cdn.shopify.com/oxygen-v2/26785/11795/24115/1039474/build/_assets/bb-favicon-32x32-3B2HSKDY.png",
      "period": "3/2020 - 1/2021",
      "description": "Architected and implemented a brand new e-commerce frontend for the company, including: a design system, full browser testing suite, and robust telemetry schema for our data scientists.",
      "responsibilities": [
        "Co-developed data contracts with the backend team to enable a new set of APIs with consistent payloads and behaviors (RESTful pattern using OpenAPI standard)",
        "Advocated-for and implemented several important runtime tools like Sentry and LogRocket to be able to quickly identify and resolve user-facing bugs that would normally be difficult to reproduce",
        "Mentored several engineers (all experience levels) over the course of my tenure",
        "Developed expertise with TypeScript"
      ]
    },
    {
      "company": "Sesame",
      "title": "Front End Architect",
      "url": "https://sesamecare.com/",
      "icon": "https://sesamecare.com/assets/sesame-favicon.png",
      "period": "8/2018 - 10/2019",
      "description": "Working in tandem with a backend engineering team in Berlin, I architected and executed a constellation of web app experiences to support a two-sided health marketplace. As a senior member of the team, I was present during the entire product development process and bridged product, design, and backend engineering.",
      "responsibilities": [
        "Designed and implemented four next.js-backed React web apps focusing on different aspects of the marketplace with diverse browser support requirements",
        "Architected a GraphQL schema for our front end data needs and implemented it using the Apollo stack",
        "Advocated for and built out multiple versions of Sesame's design system; with this we were able to push out new experiences in hours instead of days thanks to a reliable, well-tested set of system components"
      ]
    },
    {
      "company": "ZocDoc",
      "title": "Front End Architect",
      "url": "https://www.zocdoc.com/",
      "icon": "https://www.zocdoc.com/favicon_large.png",
      "period": "2/2017 - 6/2018",
      "description": "I architected and implemented a white-label solution that enabled rapid, synchronized deployment of enterprise client web products, derived from a battle-tested, homogenous core used by zocdoc.com itself (custom streaming SSR framework + design system based on React.)"
    },
    {
      "company": "Enigma",
      "title": "Technical Lead",
      "url": "https://www.enigma.com/",
      "icon": "https://cdn.prod.website-files.com/64de662ff5e68c57571c3503/64de70ca01d66a5e42c92bf4_enigma-favicon-32x32px.png",
      "period": "6/2015 - 1/2017",
      "description": "Principal front-end architecture development and implementation of the flagship product: Abstract (now \"Enigma Public\".) My responsibilities also extended to mentoring of other FE engineers, setting internal company standards for FE engineering, and project estimation."
    },
    {
      "company": "Yahoo!",
      "title": "Software Engineer",
      "url": "https://www.yahoo.com/",
      "icon": "https://www.svgrepo.com/show/349573/yahoo.svg",
      "period": "5/2014 - 5/2015",
      "description": "Lead UI engineer in a team of 30+ front-enders on Yahoo! Mail. Developed a new implementation of search in the Mail product using React. Represented the Mail team in a company-wide redesign initiative."
    },
    {
      "company": "Merge (Beam Interactive)",
      "title": "Senior Software Engineer",
      "url": "https://mergeworld.com/",
      "icon": "https://mergeworld.com/favicon.ico",
      "period": "6/2013 - 5/2014",
      "description": "Lead front-end engineer in a team of six. Wrote the majority of the HTML, CSS and JS (Angular & jQuery) in use on the new MINIUSA.com. Regularly mentored junior and mid-level developers and held info sessions on rising technologies and JS best practices. Built a data visualization tool in Angular and Express to interpret both online and offline marketing data and plot the critical paths customers took to arrive at the company's desired goals."
    }
  ],
  "openSource": {
    "description": "I am a prolific contributor to the open source community and maintain several personally-authored libraries, as well as stewardship of the styled-components constellation of libraries.",
    "projects": [
      {
        "name": "markdown-to-jsx",
        "url": "https://github.com/quantizor/markdown-to-jsx"
      },
      {
        "name": "styled-components",
        "url": "https://github.com/styled-components/styled-components"
      },
      {
        "name": "twyx",
        "url": "https://github.com/quantizor/twyx"
      }
    ]
  },
  "profiles": {
    "github": "https://github.com/quantizor",
    "linkedIn": "https://www.linkedin.com/in/probablyup",
    "x": "https://x.com/quantizor"
  }
}
